load-test.yml
config:
  target: '{{ $processEnvironment.TARGET_URL || "http://localhost:3000" }}'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "High load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Log packet distribution"
    weight: 100
    flow:
      - post:
          url: "/logs"
          json:
            emitterId: "test-emitter-{{ $randomInt(1, 10) }}"
            messages:
              - timestamp: "{{ $timestamp }}"
                level: "{{ $randomString('info', 'warn', 'error', 'debug') }}"
                message: "Test log message {{ $randomInt(1, 1000) }}"
                source: "test-service"
                metadata:
                  requestId: "{{ $uuid }}"
                  userId: "{{ $randomInt(1, 100) }}"
              - timestamp: "{{ $timestamp }}"
                level: "{{ $randomString('info', 'warn', 'error', 'debug') }}"
                message: "Another test message {{ $randomInt(1, 1000) }}"
                source: "test-service"
                metadata:
                  requestId: "{{ $uuid }}"
            metadata:
              batchId: "{{ $uuid }}"
              testRun: "load-test"
      - think: 1
      - get:
          url: "/stats"
      - think: 2